Revit 2027 API
StructuralSectionConcreteL.CutHeight Property
 Cut Height: the height of the cut in a rectangle-cut section shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CutHeight { get; set; }
Public Property CutHeight As Double
	Get
	Set
public:
property double CutHeight {
	double get ();
	void set (double value);
}
member CutHeight : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionConcreteL Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace